{
  "backend/main.mo": "Actor backend implementing player profiles, abilities, access control, and XP/level progression with match XP awards and ability unlocking.",
  "feature_evidence.json": "Feature evidence report mapping requirements to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Compiled list of short summaries for all major frontend files and components.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Root HTML document loading the React app entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router with theme provider and routes for menu, loadout, fight, and results.",
  "frontend/src/components/controls/TouchControlsOverlay.tsx": "Touch UI overlay providing movement, attack, block, and C-spec buttons for mobile devices.",
  "frontend/src/components/hud/AbilityBar.tsx": "Renders six ability slots showing icons, cooldown overlays, and keybind numbers.",
  "frontend/src/components/hud/CSpecIndicator.tsx": "Displays Sharingan C-spec activation status with icon, active/cooldown state, and progress bar.",
  "frontend/src/components/hud/FightHud.tsx": "Displays player/enemy health bars, round info, ability bar, and overlays for round results and match end.",
  "frontend/src/components/hud/RoundScoreboard.tsx": "Shows the current round number and the player's and enemy's round scores.",
  "frontend/src/components/layout/GameLayout.tsx": "Wraps the game UI with background styling and a fixed footer.",
  "frontend/src/components/loadout/AbilitySlotPicker.tsx": "Lets players assign abilities to slots and pick from available abilities.",
  "frontend/src/components/loadout/StylePicker.tsx": "Allows selection of a fighting style with stats and visual indicators.",
  "frontend/src/components/profile/ProfileBadge.tsx": "Displays a player's name, level, and XP progress.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for creating and saving a new player profile by entering a name.",
  "frontend/src/game/content/styles.ts": "Defines fighting styles and elemental abilities with stats and metadata.",
  "frontend/src/game/engine/GameEngine.ts": "Core game loop handling fighters, abilities, state updates, and rendering.",
  "frontend/src/game/input/InputManager.ts": "Tracks keyboard, mouse, and gamepad input to produce action states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity, recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login, logout, and status controls.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating player profile data and awarding match XP using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind CSS layers, theme variables, and global styles for typography, colors, and layout.",
  "frontend/src/main.tsx": "Bootstraps the React app by wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/FightPage.tsx": "Initializes the game engine and input manager, runs the fight loop, and navigates to the results page when a match ends.",
  "frontend/src/pages/LoadoutPage.tsx": "Allows players to choose a fighting style and abilities, saving the loadout to session storage and starting a fight.",
  "frontend/src/pages/MainMenuPage.tsx": "Displays the main menu with login/logout, mode selection, and profile handling, and navigates to loadout on match start.",
  "frontend/src/pages/ResultsPage.tsx": "Shows match results, awards XP if authenticated, computes level progression, and provides navigation to restart or return to menu.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helpers to read URL params (including hash routing), persist them in sessionStorage, and clear stored or hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, fonts, and enabling typography, container-queries, and animation plugins.",
  "project_state.json": "Project metadata describing game concept, required assets, existing features, and versioned project state for a 2D anime-style fighting game."
}